/********************************************************************************************************/

/*-----------------------------------------  I N C L U D E S  -----------------------------------------*/
#include "usart.h"
/*---------------------------------------  D E F I N I T I O N  ---------------------------------------*/

/*----------------------------------------  V A R I A B L E     ----------------------------------------*/


/*----------------------------------------  F U N C T I O N S  ----------------------------------------*/

/********************************************************************************************************
Description  : 串口初始化
Inputs       : baud：波特率   4800->25  9600->12  38400->3
Outputs      : None
********************************************************************************************************/



void USART_Init(UINT16 baud)
{
    //端口初始化 PD0->Rx  PD1->Tx
    //不用配置IO口的输入输出，当使能USART功能后，这两个引脚会强制变为输入输出
    UCSRC |= (UCSRC_URSEL | USART_UCSZ1 | USART_UCSZ0);        //8位字符长度
    UCSRC &= ~(USART_UMSEL | USART_UPM | USART_USBS);          //异步工作模式,无奇偶校验位,1位停止位
    //UCSRB &= ~USART_UCSZ2;

    //波特率配置
    UCSRA |= USART_U2X;                 //倍速发送
    UBRRH &= ~UBRRH_URSEL;              //对UBRRH进行写操作
    UBRRH = (UINT8)(baud >> 8);
    UBRRL = (UINT8)baud;

    //发送接收使能
    UCSRB |= (USART_RXCIE|USART_RXEN|USART_TXEN);  //发送接收使能
}
/********************************************************************************************************
Description  : 串口接收
Inputs       : None
Outputs      : 接收到的数
********************************************************************************************************/
UINT8 USART_Rx(void)
{
    UINT8 buf;
    while((UCSRA&USART_FLAG_RXC) == 0)   //等待接收结束
    buf=  UDR;                           //读取接收到的值
    UCSRA &= ~USART_FLAG_RXC;            //清零标志位
    return buf;
}
/********************************************************************************************************
Description  : 串口发送
Inputs       : 要发送的数据
Outputs      : None
********************************************************************************************************/
void USART_Tx(UINT8 buf)
{
    UCSRA |= USART_FLAG_UDRE;             //准备好发送数据  应该等待数据寄存器空 while(!(UCSRA&(1<<UDRE)));
    UDR = buf;                            //将数据写入发送寄存器
    while((UCSRA&USART_FLAG_TXC) == 0);    //等待发送完成
}


//===========================================  End Of File  ===========================================//
